---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedLayered.SurfaceNormal
source: html/096bf777-09a9-b426-a389-917d7caf4d93.htm
---
# Autodesk.Revit.DB.Visual.AdvancedLayered.SurfaceNormal Property

The property labeled "Image" from the "AdvancedLayered" schema.

## Syntax (C#)
```csharp
public static string SurfaceNormal { get; }
```

## Remarks
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.